zoubata/ArduinoCore-samd/variants/Pilo/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_ARDUINO_ZERO_
#define _VARIANT_ARDUINO_ZERO_

// The definitions here needs a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK			  (48000000ul)
/* If CLOCKCONFIG_HS_CRYSTAL is defined, then HS_CRYSTAL_FREQUENCY_HERTZ
 * must also be defined with the external crystal frequency in Hertz.
 */
#define HS_CRYSTAL_FREQUENCY_HERTZ	16000000UL

/* If the PLL is used (CLOCKCONFIG_32768HZ_CRYSTAL, or CLOCKCONFIG_HS_CRYSTAL
 * defined), then PLL_FRACTIONAL_ENABLED can be defined, which will result in
 * a more accurate 48MHz output frequency at the expense of increased jitter.
 */
//#define PLL_FRACTIONAL_ENABLED

/* If both PLL_FAST_STARTUP and CLOCKCONFIG_HS_CRYSTAL are defined, the crystal
 * will be divided down to 1MHz - 2MHz, rather than 32KHz - 64KHz, before being
 * multiplied by the PLL. This will result in a faster lock time for the PLL,
 * however, it will also result in a less accurate PLL output frequency if the
 * crystal is not divisible (without remainder) by 1MHz. In this case, define
 * PLL_FRACTIONAL_ENABLED as well.
 */
//#define PLL_FAST_STARTUP

/* The fine calibration value for DFLL open-loop mode is defined here.
 * The coarse calibration value is loaded from NVM OTP (factory calibration values).
 */
#define NVM_SW_CALIB_DFLL48M_FINE_VAL     (512)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"
#include "sam.h"

#ifdef __cplusplus
#include "SERCOM.h"
#include "Uart.h"
#endif // __cplusplus

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define NUM_PIN_DESCRIPTION_ENTRIES     (32u)

#define PINS_COUNT           NUM_PIN_DESCRIPTION_ENTRIES
#define NUM_DIGITAL_PINS     PINS_COUNT
#define NUM_ANALOG_INPUTS    (10u)
#define NUM_ANALOG_OUTPUTS   (1u)
#define analogInputToDigitalPin(p)  (p)

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)

/* LEDs
 * None of these defines are currently used by the core.
 * The MT-D21E onboard LED is on pin 28.
 * The RX and TX LEDs are not present.
 * You may optionally add them to any free pins.
 *
#define PIN_LED_13           (28u)
#define PIN_LED_RXL          (30u)
#define PIN_LED_TXL          (31u)

#define PIN_LED              PIN_LED_13
#define PIN_LED2             PIN_LED_RXL
#define PIN_LED3             PIN_LED_TXL
#define LED_BUILTIN          PIN_LED_13
*/
/*
 * Analog pins
 */
#define PIN_A0               (42ul)
#define PIN_A1               (43ul)
#define PIN_A2               (10ul)
#define PIN_A3               (11ul)
#define PIN_A4               ( 6ul)
#define PIN_A5               ( 7ul)
#define PIN_A6               ( 8ul)
#define PIN_A7               ( 9ul)
#define PIN_A8               (16ul)
#define PIN_A9               (17ul)
#define PIN_A10              (44ul)
#define PIN_A11              (45ul)
#define PIN_A12              (46ul)
#define PIN_A13              (47ul)
#define PIN_A14              (48ul)
#define PIN_A15              (49ul)
#define PIN_DAC0            PIN_A12

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t DAC0 = PIN_DAC0;

// arduino pin number based on Pcom pin number of connector
//==================================
#define P_COM0_PIN6     0
#define P_COM0_PIN5     1
#define P_COM0_PIN8     2
#define P_COM0_PIN7     3
#define P_COM0_PIN10     4
#define P_COM0_PIN9     5

#define P_COM0_BIS_PIN6     6
#define P_COM0_BIS_PIN5     7
#define P_COM0_BIS_PIN8     8
#define P_COM0_BIS_PIN7     9
#define P_COM0_BIS_PIN10     10
#define P_COM0_BIS_PIN9     11

#define P_COM_1_PIN6     12
#define P_COM_1_PIN5     13
#define P_COM_1_PIN8     14
#define P_COM_1_PIN7     15
#define P_COM_1_PIN10     16
#define P_COM_1_PIN9     17

#define P_COM_2_PI_PIN6     18
#define P_COM_2_PI_PIN5     19
#define P_COM_2_PI_PIN8     20
#define P_COM_2_PI_PIN7     21
#define P_COM_2_PI_PIN10     23
#define P_COM_2_PI_PIN9     22

#define P_COM_3_PIN6     24
#define P_COM_3_PIN5     25
#define P_COM_3_PIN8     26
#define P_COM_3_PIN7     27
#define P_COM_3_PIN10     28
#define P_COM_3_PIN9     29

#define P_COM_4_PIN6     30
#define P_COM_4_PIN5     31
#define P_COM_4_PIN8     32
#define P_COM_4_PIN7     33
#define P_COM_4_PIN10     34
#define P_COM_4_PIN9     35

#define P_COM_5_PIN6     36
#define P_COM_5_PIN5     37
#define P_COM_5_PIN8     38
#define P_COM_5_PIN7     39
#define P_COM_5_PIN10     40
#define P_COM_5_PIN9     41

















#define CAN_PIN2     42
#define CAN_PIN3     43



#define PANA1_PIN4     42
#define PANA1_PIN6     43
#define PANA1_PIN8     10
#define PANA1_PIN10     11
#define PANA1_PIN12     6
#define PANA1_PIN14     7
#define PANA1_PIN16     8
#define PANA1_PIN18     9



#define PANA2_PIN4     16
#define PANA2_PIN6     17
#define PANA2_PIN8     44
#define PANA2_PIN10     45
#define PANA2_PIN12     46
#define PANA2_PIN14     47
#define PANA2_PIN16     48
#define PANA2_PIN18     49







#define FTDI_PIN8     14
#define FTDI_PIN7     15


#define DEBUG SWD_PIN8     14
#define DEBUG SWD_PIN7     15


