zoubata/ArduinoCore-samd/variants/Pilo/variant.h
#define LIN_PIN8     14
#define LIN_PIN7     15
#define LIN_PIN9     17

// arduino pin number based on Pcom pin name
//==================================
#define P_COM0_P0     0
#define P_COM0_P1     1
#define P_COM0_P2     2
#define P_COM0_P3     3
#define P_COM0_P4     4
#define P_COM0_P5     5

#define P_COM0_BIS_P0     6
#define P_COM0_BIS_P1     7
#define P_COM0_BIS_P2     8
#define P_COM0_BIS_P3     9
#define P_COM0_BIS_P4     10
#define P_COM0_BIS_P5     11

#define P_COM_1_P0     12
#define P_COM_1_P1     13
#define P_COM_1_P2     14
#define P_COM_1_P3     15
#define P_COM_1_P4     16
#define P_COM_1_P5     17

#define P_COM_2_PI_P0     18
#define P_COM_2_PI_P1     19
#define P_COM_2_PI_P2     20
#define P_COM_2_PI_P3     21
#define P_COM_2_PI_P4     23
#define P_COM_2_PI_P5     22

#define P_COM_3_P0     24
#define P_COM_3_P1     25
#define P_COM_3_P2     26
#define P_COM_3_P3     27
#define P_COM_3_P4     28
#define P_COM_3_P5     29

#define P_COM_4_P0     30
#define P_COM_4_P1     31
#define P_COM_4_P2     32
#define P_COM_4_P3     33
#define P_COM_4_P4     34
#define P_COM_4_P5     35

#define P_COM_5_P0     36
#define P_COM_5_P1     37
#define P_COM_5_P2     38
#define P_COM_5_P3     39
#define P_COM_5_P4     40
#define P_COM_5_P5     41


// arduino INT number based on Pcom pin name
//==================================
#define P_COM0_P0_INT     EXTERNAL_INT_NMI
#define P_COM0_P1_INT     EXTERNAL_INT_9
#define P_COM0_P2_INT     EXTERNAL_INT_10
#define P_COM0_P3_INT     EXTERNAL_INT_11
#define P_COM0_P4_INT     EXTERNAL_INT_5
#define P_COM0_P5_INT     EXTERNAL_INT_2

#define P_COM0_BIS_P0_INT     EXTERNAL_INT_4
#define P_COM0_BIS_P1_INT     EXTERNAL_INT_5
#define P_COM0_BIS_P2_INT     EXTERNAL_INT_6
#define P_COM0_BIS_P3_INT     EXTERNAL_INT_7
#define P_COM0_BIS_P4_INT     EXTERNAL_INT_9
#define P_COM0_BIS_P5_INT     EXTERNAL_INT_8

#define P_COM_1_P0_INT     EXTERNAL_INT_0
#define P_COM_1_P1_INT     EXTERNAL_INT_1
#define P_COM_1_P2_INT     EXTERNAL_INT_10
#define P_COM_1_P3_INT     EXTERNAL_INT_11
#define P_COM_1_P4_INT     EXTERNAL_INT_0
#define P_COM_1_P5_INT     EXTERNAL_INT_1

#define P_COM_2_PI_P0_INT     EXTERNAL_INT_12
#define P_COM_2_PI_P1_INT     EXTERNAL_INT_13
#define P_COM_2_PI_P2_INT     EXTERNAL_INT_14
#define P_COM_2_PI_P3_INT     EXTERNAL_INT_15
#define P_COM_2_PI_P4_INT     EXTERNAL_INT_1
#define P_COM_2_PI_P5_INT     EXTERNAL_INT_0

#define P_COM_3_P0_INT     EXTERNAL_INT_6
#define P_COM_3_P1_INT     EXTERNAL_INT_7
#define P_COM_3_P2_INT     EXTERNAL_INT_12
#define P_COM_3_P3_INT     EXTERNAL_INT_13
#define P_COM_3_P4_INT     EXTERNAL_INT_4
#define P_COM_3_P5_INT     EXTERNAL_INT_3

#define P_COM_4_P0_INT     EXTERNAL_INT_12
#define P_COM_4_P1_INT     EXTERNAL_INT_13
#define P_COM_4_P2_INT     EXTERNAL_INT_14
#define P_COM_4_P3_INT     EXTERNAL_INT_15
#define P_COM_4_P4_INT     EXTERNAL_INT_0
#define P_COM_4_P5_INT     EXTERNAL_INT_1

#define P_COM_5_P0_INT     EXTERNAL_INT_14
#define P_COM_5_P1_INT     EXTERNAL_INT_15
#define P_COM_5_P2_INT     EXTERNAL_INT_6
#define P_COM_5_P3_INT     EXTERNAL_INT_7
#define P_COM_5_P4_INT     EXTERNAL_INT_15
#define P_COM_5_P5_INT     EXTERNAL_INT_8

// arduino INT number based on Pcom pin name
//==================================
#define P_COM0_P0_TMR     TCC1_CH2
#define P_COM0_P1_TMR     TCC1_CH3
#define P_COM0_P2_TMR     TCC0_CH2
#define P_COM0_P3_TMR     TCC0_CH3
#define P_COM0_P4_TMR     TC3_CH1
#define P_COM0_P5_TMR     TC4_CH0

#define P_COM0_BIS_P0_TMR     TCC0_CH0
#define P_COM0_BIS_P1_TMR     TCC0_CH1
#define P_COM0_BIS_P2_TMR     TCC1_CH0
#define P_COM0_BIS_P3_TMR     TCC1_CH1
#define P_COM0_BIS_P4_TMR     TC0_CH1
#define P_COM0_BIS_P5_TMR     TC0_CH0

#define P_COM_1_P0_TMR     TCC2_CH0
#define P_COM_1_P1_TMR     TCC2_CH1
#define P_COM_1_P2_TMR     TCC1_CH0
#define P_COM_1_P3_TMR     TCC1_CH1
#define P_COM_1_P4_TMR     TC3_CH0
#define P_COM_1_P5_TMR     TC3_CH1

#define P_COM_2_PI_P0_TMR     TCC0_CH6
#define P_COM_2_PI_P1_TMR     TCC0_CH7
#define P_COM_2_PI_P2_TMR     TCC0_CH4
#define P_COM_2_PI_P3_TMR     TCC0_CH5
#define P_COM_2_PI_P4_TMR     TCC2_CH1
#define P_COM_2_PI_P5_TMR     TCC2_CH0

#define P_COM_3_P0_TMR     TC0_CH0
#define P_COM_3_P1_TMR     TC0_CH1
#define P_COM_3_P2_TMR     TC1_CH0
#define P_COM_3_P3_TMR     TC1_CH1
#define P_COM_3_P4_TMR     TC3_CH0
#define P_COM_3_P5_TMR     TC4_CH1

#define P_COM_4_P0_TMR     TC0_CH0
#define P_COM_4_P1_TMR     TC0_CH1
#define P_COM_4_P2_TMR     TC1_CH0
#define P_COM_4_P3_TMR     TC1_CH1
#define P_COM_4_P4_TMR     TC2_CH0
#define P_COM_4_P5_TMR     TC2_CH1

#define P_COM_5_P0_TMR     TCC0_CH0
#define P_COM_5_P1_TMR     TCC0_CH1
#define P_COM_5_P2_TMR     TC3_CH0
#define P_COM_5_P3_TMR     TC3_CH1

// arduino ATTRIBUTE based on Pcom pin name (not yet manage : PIN_ATTR_ADC , PIN_ATTR_DAC , PIN_ATTR_REF , PIN_ATTR_AC)
//==================================
#define P_COM0_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM0_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM0_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM0_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)

#define P_COM0_BIS_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_BIS_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_BIS_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_BIS_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_BIS_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM0_BIS_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)

#define P_COM_1_P0_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM_1_P1_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM_1_P2_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_AC_GCLK | PIN_ATTR_DIGITAL)
#define P_COM_1_P3_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM_1_P4_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)
#define P_COM_1_P5_PIN_ATTRIB     (PIN_ATTR_EXTINT | PIN_ATTR_SERCOM | PIN_ATTR_TIMER | PIN_ATTR_DIGITAL)

